<template>
  <div class="my-8">
    <section-title
      title="Privacy Policy"
      subtitle="プライバシーポリシーの内容にご同意頂き本サイトをご利用ください"
    />
    <div class="mt-5 bg-gray-200">
      <div class="container mx-auto py-10 px-4">
        <div class="w-full mx-auto lg:w-2/3">
          <h3>1. 個人情報等の収集方針</h3>
          <p>
            本ポリシーにおける「個人情報」とは、個人情報の保護に関する法律に規定される個人情報をいい、
            氏名・Eメールアドレス、電話番号等の生存する特定の個人を識別することができる情報をいいます。
            ウェブサイトにおいてお客さまに個人情報等の提供をお願いする際は、収集目的及び第三者提供を行う場合を明示し、
            お客さまの同意を得てから行います。
            尚、提供を頂いた個人情報は、その他の情報源（名簿、住所録、第三者等）から間接的に収集した情報で統合、
            加工されることはございません。
          </p>
          <h3>2. 個人情報等の利用目的について</h3>
          <p>
            本ウェブサイトでは、お客様からのお問い合わせ時に、氏名・Eメールアドレス、電話番号等の個人情報をご登録いただく場合がございますが、
            これらの個人情報はご提供いただく際の目的以外では利用いたしません。<br />
            お客さまからお預かりした個人情報は、弊社からのご連絡や業務のご案内やご質問に対する回答として、電子メールや資料のご送付に利用いたします。<br />
          </p>
          <h3>3. 個人情報等の提供について</h3>
          <p>
            お客さまよりお預かりした個人情報を適切に管理し、次のいずれかに該当する場合を除き、個人情報を第三者に開示いたしません。<br />
            ・お客さまの同意がある場合<br />
            ・法令に基づき開示することが必要である場合<br />
          </p>
          <h3>4. 個人情報の安全対策・セキュリティについて</h3>
          <p>
            お客さまからウェブサイトを通じて個人情報を提供いただく際には、第三者による不正アクセスに備え、安全性の確保に努めます。
          </p>
          <h3>5. ご本人の照会</h3>
          <p>
            お客さまがご本人の個人情報の照会・修正・削除などをご希望される場合には、ご本人であることを確認の上、対応させていただきます。
          </p>
          <h3>6. Cookieについて</h3>
          <p>
            ウェブサイトでは、お客さまがより便利にご利用いただけるよう、Cookieと呼ばれる技術を使用しております。<br />
            お客さまがアクセスされた際、サーバーからの指示により、お客さまの端末にお客さまからアクセスがあったことを識別するための情報を記録し、
            再度お客さまからアクセスがあった際に当該お客さまの端末であることを識別し、スムーズにご利用いただけるようにする技術です。<br />
            ウェブサイトのトラフィックの調査のため利用されます。
          </p>
          <h3>7. アクセスログについて</h3>
          <p>
            ウェブサイトでは、お客さまのアクセス情報をログとして記録しております。<br />
            記録された情報には、アクセスされた方のIPアドレス、OSその他利用端末情報、アクセス日時等が含まれますが、
            個人を特定する目的の利用はしておりません。<br />
            アクセスログはウェブサイトの管理や利用状況に関する分析のために利用いたします。
          </p>
          <h3>8. 法令、規範の遵守と見直し</h3>
          <p>
            弊社は、保有する個人情報に関して適用される香港の法令、その他規範を遵守するとともに、
            本ポリシーの内容を適宜見直し、その改善に努めます。
          </p>
          <h3>9. お問い合せ</h3>
          <p>
            弊社の個人情報の取扱に関するお問い合せは下記までご連絡ください。<br />
            <br />
            <strong>
              GrowHub Limited<br />
              FLAT 6A 14/F BLK A FUK KEUG IND BLDG 66-68 TONG MI RD PRINCE
              EDWARD KL
            </strong>
          </p>
          <p>
            制定日：2019年9月17日
          </p>
        </div>
      </div>
    </div>
  </div>
</template>

<script lang="ts">
import { createComponent } from '@vue/composition-api'
import SectionTitle from '~/components/molecules/SectionTitle.vue'

export default createComponent({
  components: {
    SectionTitle
  }
})
</script>

<style scoped>
h3 {
  @apply font-bold text-xl text-gray-900 mb-1;
}
p {
  @apply text-gray-800 mb-6;
}
</style>
