<template>
  <div class="my-8">
    <section-title title="Term" subtitle="本サービスの利用規約となります" />
    <div class="mt-5 bg-gray-200">
      <div class="container mx-auto py-10 px-4">
        <div class="w-full mx-auto lg:w-2/3">
          <p>
            この利用規約（以下，「本規約」といいます。）は，GrowHub Limited
            （以下，「当社」といいます。）がこのウェブサイト上で提供するサービス
            （以下，「本サービス」といいます。）の利用条件を定めるものです。<br />
            ユーザーの皆さまには，本規約に従って，当サイトをご利用いただきます。
          </p>
          <h3>規約の適用</h3>
          <p>
            ユーザーと当社との間の本サービスの利用に関わる一切の関係に適用されるものとします
          </p>
          <h3>本サービスの内容</h3>
          <p>
            インターネット上で提供するエンジニアリング・プログラミングサポートサービスです。
          </p>
          <h3>利用登録</h3>
          <p>
            登録希望者が当社の定める方法によって利用登録を申請し，当社がこれを承認することによって，利用登録が完了するものとします。
            当社は，利用登録の申請者に以下の事由があると判断した場合，利用登録の申請を承認しないことがあり，その理由については一切の開示義務を負わないものとします。<br />
            <br />
            ・利用登録の申請に際して虚偽の事項を届け出た場合<br />
            ・本規約に違反したことがある者からの申請である場合<br />
            ・その他，当社が利用登録を相当でないと判断した場合<br />
          </p>
          <h3>利用料金および支払方法</h3>
          <p>
            1. ユーザーは契約した場合、
            プランに定める利用料金を支払うものとします。<br />
            2. 料金の支払はクレジットカードを用いるものとします。<br />
            3. 定期支払いプランの場合、
            プランが解約されるまで自動継続になります。<br />
            4. ユーザーが料金の督促に応じない場合は、
            利用継続の意思がないものと判断し、契約を終了します。<br />
          </p>
          <h3>禁止事項</h3>
          <p>
            ユーザーは，本サービスの利用にあたり，以下の行為をしてはなりません。<br />
            <br />
            1. 法令または公序良俗に違反する行為<br />
            2. 犯罪行為に関連する行為<br />
            3. 当社のサーバーまたはネットワークの機能を破壊したり，
            妨害したりする行為<br />
            4. 当社のサービスの運営を妨害するおそれのある行為<br />
            5. 他のユーザーに関する個人情報等を収集または蓄積する行為<br />
            6. 他のユーザーに成りすます行為<br />
            7. 当社のサービスに関連して，
            反社会的勢力に対して直接または間接に利益を供与する行為<br />
            8. その他，当社が不適切と判断する行為<br />
          </p>
          <h3>本サービスの提供の停止等</h3>
          <p>
            1. 当社は，以下のいずれかの事由があると判断した場合，
            ユーザーに事前に通知することなく本サービスの全部または一部の提供を停止または中断することができるものとします。<br />
            （1）本サービスにかかるコンピュータシステムの保守点検または更新を行う場合<br />
            （2）地震，落雷，火災，停電または天災などの不可抗力により，本サービスの提供が困難となった場合<br />
            （3）コンピュータまたは通信回線等が事故により停止した場合<br />
            （4）その他，当社が本サービスの提供が困難と判断した場合<br />
            修正された最新のプライバシーポリシーは常に本ページにて開示されます。<br />
            2. 当社は，本サービスの提供の停止または中断により，
            ユーザーまたは第三者が被ったいかなる不利益または損害について，
            理由を問わず一切の責任を負わないものとします。<br />
          </p>
          <h3>免責事項</h3>
          <p>
            1. 当社の債務不履行責任は，
            当社の故意または重過失によらない場合には免責されるものとします。<br />
            2. 当社は，何らかの理由によって責任を負う場合にも，
            通常生じうる損害の範囲内かつ有料サービスにおいては代金額（継続的サービスの場合には1か月分相当額）
            の範囲内においてのみ賠償の責任を負うものとします。<br />
            3. 当社は，本サービスに関して，
            ユーザーと他のユーザーまたは第三者との間において生じた取引，
            連絡または紛争等について一切責任を負いません。<br />
          </p>
          <h3>サービス内容の変更等</h3>
          <p>
            当社は，ユーザーに通知することなく，
            本サービスの内容を変更しまたは本サービスの提供を中止することができるものとし，
            これによってユーザーに生じた損害について一切の責任を負いません。
          </p>
          <h3>利用規約の変更</h3>
          <p>
            当社は，必要と判断した場合には，ユーザーに通知することなくいつでも本規約を変更することができるものとします。
          </p>
          <h3>通知または連絡</h3>
          <p>
            ユーザーと当社との間の通知または連絡は，当社の定める方法によって行うものとします。
          </p>
          <h3>権利義務の譲渡の禁止</h3>
          <p>
            ユーザーは，当社の書面による事前の承諾なく，
            利用契約上の地位または本規約に基づく権利もしくは義務を第三者に譲渡し，
            または担保に供することはできません。
          </p>
          <h3>準拠法・裁判管轄</h3>
          <p>
            1. 本規約の解釈にあたっては，香港法を準拠法とします。<br />
            2. 本サービスに関して紛争が生じた場合には，
            当社の本店所在地を管轄する裁判所を専属的合意管轄とします。
          </p>
        </div>
      </div>
    </div>
  </div>
</template>

<script lang="ts">
import { createComponent } from '@vue/composition-api'
import SectionTitle from '~/components/molecules/SectionTitle.vue'

export default createComponent({
  components: {
    SectionTitle
  }
})
</script>

<style scoped>
h3 {
  @apply font-bold text-xl text-gray-900;
}
p {
  @apply text-gray-800 mb-6;
}
</style>
